tap "1password/tap"
tap "agrinman/tap"
tap "ddddddo/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "hpedrorodrigues/tools"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "playcover/playcover"
tap "qmk/qmk"
tap "shopify/shopify"
tap "stripe/stripe-cli"
tap "yutakobayashidev/formulae"

cask_args appdir: "/Applications"

brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libssh2"
brew "aria2"
brew "asciidoctor"
brew "boost"
brew "avrdude"
brew "awscli"
brew "bat"
brew "glib"
brew "ccache", args: ["HEAD"]
brew "pycparser"
brew "cffi"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "dart-sdk"
brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "ethereum"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libssh"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gocryptfs"
brew "libfido2"
brew "mysql-client"
brew "hydra"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "llvm"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "mise"
brew "neofetch"
brew "neovim"
brew "openssh"
brew "openssl@1.1"
brew "peco"
brew "tcl-tk"
brew "pillow"
brew "portaudio"
brew "protobuf"
brew "qrencode"
brew "sl"
brew "spotify-tui"
brew "spotifyd"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "torsocks"
brew "transmission-cli"
brew "tree"
brew "wabt"
brew "wasm-pack"
brew "wasmtime"
brew "watchman"
brew "wget"
brew "yt-dlp"
brew "zbar"
brew "zplug"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "agrinman/tap/tunnelto"
brew "heroku/brew/heroku"
brew "planetscale/tap/pscale"
brew "qmk/qmk/qmk"
brew "shopify/shopify/shopify-cli"
brew "stripe/stripe-cli/stripe"

cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "android-studio"
cask "appcleaner"
cask "arc"
cask "amazon-q"
cask "bettertouchtool"
cask "blackhole-2ch"
cask "blockbench"
cask "brooklyn"
cask "chatgpt"
cask "cleanmymac"
cask "cloudflare-warp"
cask "cursor"
cask "deepl"
cask "diffusionbee"
cask "discord"
cask "discord@canary"
cask "docker"
cask "dropbox"
cask "element"
cask "elgato-stream-deck"
cask "epic-games"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-mplus"
cask "gather"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gpg-suite"
cask "grammarly"
cask "hyper"
cask "insomnia"
cask "iterm2"
cask "jquake"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "krita"
cask "lark"
cask "linear-linear"
cask "local"
cask "mattermost"
cask "mem"
cask "messenger"
cask "microsoft-edge"
cask "mimestream"
cask "minecraft"
cask "minecraft-education"
cask "miro"
cask "netron"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "notchnook"
cask "obs"
cask "obsidian"
cask "ogdesign-eagle"
cask "orbstack"
cask "osu"
cask "parsec"
cask "playcover-community"
cask "proxyman"
cask "qgis"
cask "qmk-toolbox"
cask "raycast"
cask "signal"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tor-browser"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zed"
cask "zoom"

if ENV.fetch('CI', 'false') == 'false'
    mas "DaVinci Resolve", id: 571213070
    mas "Developer", id: 640199958
    mas "RunCat", id: 1429033973
    mas "TestFlight", id: 899247664
    mas "Xcode", id: 497799835
end

vscode "1yib.rust-bundle"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "artdiniz.quitcontrol-vscode"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "icrawl.discord-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "katsute.code-background"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "mushan.vscode-paste-image"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "satokaz.vscode-bs-ctrlchar-remover"
vscode "shyykoserhiy.vscode-spotify"
vscode "spywhere.guides"
vscode "suhelmakkad.shadcn-ui"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "unthrottled.doki-theme"
vscode "vitest.explorer"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "ygkn.storybook-opener"
vscode "yoavbls.pretty-ts-errors"
vscode "zenn.zenn-preview"
vscode "ziglang.vscode-zig"