tap "1password/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "hpedrorodrigues/tools"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shopify/shopify"
tap "yutakobayashidev/formulae"

cask_args appdir: "/Applications"

brew "aria2"
brew "coreutils"
brew "asdf"
brew "docutils"
brew "awscli"
brew "bat"
brew "ccache", args: ["HEAD"]
brew "cmake"
brew "cocoapods"
brew "curl"
brew "dart-sdk"
brew "direnv"
brew "ethereum"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "gnupg"
brew "hydra"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "mas"
brew "neofetch"
brew "neovim"
brew "openssh"
brew "peco"
brew "portaudio"
brew "protobuf"
brew "qrencode"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "torsocks"
brew "watchman"
brew "wget"
brew "yt-dlp"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "qmk/qmk/qmk"
brew "shopify/shopify/shopify-cli"

cask "1password-cli"
cask "android-studio"
cask "arc"
cask "blockbench"
cask "brooklyn"
cask "chatgpt"
cask "cleanmymac"
cask "cron"
cask "deepl"
cask "diffusionbee"
cask "discord"
cask "docker"
cask "dropbox"
cask "element"
cask "epic-games"
cask "elgato-stream-deck"
cask "fig"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-mplus"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gpg-suite"
cask "grammarly"
cask "iterm2"
cask "jquake"
cask "keybase"
cask "kindle"
cask "krita"
cask "linear-linear"
cask "local"
cask "mem"
cask "miro"
cask "messenger"
cask "mimestream"
cask "minecraft"
cask "minecraftpe"
cask "notion"
cask "nvidia-geforce-now"
cask "obs"
cask "ogdesign-eagle"
cask "proxyman"
cask "qmk-toolbox"
cask "raycast"
cask "readdle-spark"
cask "signal"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tor-browser"
cask "unity-hub"

cask "visual-studio-code"

if ENV.fetch('CI', 'false') == 'false'
    mas "DaVinci Resolve", id: 571213070
    mas "Draw Things", id: 6444050820
    mas "RunCat", id: 1429033973
    # mas "TestFlight", id: 899247664 https://github.com/electron/osx-sign/issues/251
    mas "Twitter", id: 1482454543
    mas "Xcode", id: 497799835
end